// src/data/gcode-data.js
// G代码、M代码、宏代码数据

export const G_CODES = [
  {
    title: 'G00(快速移动)',
    content: `G00 快速定位
格式 G00 X__ Z__
这个命令把刀具从当前位置移动到命令指定的位置。`
  },
  {
    title: 'G01(直线切削)',
    content: `G01 慢速移动
格式 G01 X__ Z__ F__
这个命令把刀具从当前位置按照给定的移动速率移动到命令指定的位置。`
  },
  {
    title: 'G02(顺时针切削圆弧)',
    content: `G02/G03 圆弧插补(G02, G03)
格式 G02(G03) X(U)_ Z(W)_ I_ K_ F_;
G02(G03) X(U)_ Z(W)_ R_ F_;
G02 - 顺时钟(CW)
G03 - 逆时钟(CCW)
X, Z - 在坐标系里的终点
U, W - 起点与终点之间的距离
I, K - 从起点到中心点的矢量(半径值)
例:
G02 X100. Z90. I50. K0. F0.2
或
G02 X100. Z90. R50. F0.2`
  },
  {
    title: 'G03(逆时针切削圆弧)',
    content: `G02/G03 圆弧插补(G02, G03)
格式 G02(G03) X(U)_ Z(W)_ I_ K_ F_;
G02(G03) X(U)_ Z(W)_ R_ F_;
G02 - 顺时钟(CW)
G03 - 逆时钟(CCW)
X, Z - 在坐标系里的终点
U, W - 起点与终点之间的距离
I, K - 从起点到中心点的矢量(半径值)
例:
G03 X100. Z90. I50. K0. F0.2
或
G03 X100. Z90. R50. F0.2`
  },
  {
    title: 'G04(暂停)',
    content: `G04 暂停
格式 G04 X1000 (暂停1秒)
G04 P1000 (暂停1秒)
暂停指定的时间后继续走下一步程序`
  },
  {
    title: 'G05三点圆弧插补',
    content: `代码格式: G05 X(U)_ Z(W)_ I_ K_ F_
代码功能: 如果不知道圆弧的圆心,半径但已知圆弧轮廓上的三个点的坐标,则可使用G05功能,通过始点和终点之间的中间点位置确定圆弧方向
代码说明: G05为模态G代码;
I: 圆弧所经过的中间点相对于起点的相对坐标值(X向)(半径值表示,带方向)
K: 圆弧所经过的中间点相对于起点相对坐标值(Z向,带方向)`
  },
  {
    title: 'G6.2、G6.3椭圆插补',
    content: `代码格式 G6.2)G6.3 X(U)_ Z(W)_ A_ B_ Q_
代码功能: G6.2,6.3为模态G代码
G6.2代码运动轨迹为从起点到终点的顺时针(后刀座坐标系)/逆时针(前刀座坐标系)椭圆。
G6.3代码运动轨迹为从起点到终点的逆时针(后刀座坐标系)/顺时针(前刀座坐标系)椭圆。`
  },
  {
    title: 'G7.2、G7.3抛物线插补',
    content: `代码格式:(G7.2)G7.3 X(U)_ Z(W)_ P_ Q_
代码功能: G7.2代码运动轨迹为从起点到终点的顺时针(后刀座坐标系)/逆时针(前刀座坐标系)抛物线;
G7.3代码运动轨迹为从起点到终点的逆时针(后刀座坐标系)/顺时针(前刀座坐标系)抛物线。
代码说明: G7.2、G7.3为模态G代码
P为抛物线标准方程Y²=2PX中的P值，取值范围1~99999999(单位:最小输入增量,无符号);
Q为抛物线对称轴与Z轴的夹角，取值范围0~99999999(单位:0.001度,无符号);
抛物线方向: G7.2, G7.3插补的方向定义，在前刀座坐标系和后刀座坐标系是相反的
Q值说明: Q值是指在右手直角笛卡尔坐标系中,从Y轴的正方向俯视XZ平面,Z轴正方向顺时针方向旋转到与抛物线对称轴重合时所经过的角度
注意事项: P值不可以为零或省略，否则产生报警;P值不含符号，如果输入了负值，则取其绝对值;Q值可省略，当省略Q值时，则抛物线的对称轴与Z轴平行或重合，Q不含符号;当起点与终点所在的直线与抛物线的对称轴平行时，产生报警;G7.2、G7.3代码可用于复合循环G70—G73和C刀补中。`
  },
  {
    title: 'G17～G19(平面选择代码)',
    content: `代码格式:
G17……XY平面
G18……ZX平面
G19……YZ平面
代码功能: 用G代码选择圆弧插补的平面或刀具半径补偿的平面
代码说明: G17, G18, G19为模态G代码，在没指令的程序段里,平面不发生变化。
注意事项: 选择G17、G19平面时要先设定基本轴Y;C刀补状态下不能进行平面切换;G71~G76, G90, G92, G94只能在G18平面内使用;平面选择代码可与其他组G代码共段;移动指令与平面选择无关;
关于直径或半径编程的处理: 由于当前只有一个位参数No1.2选择是直径还是半径编程且只对X轴有效，因此在使用G2, G3等指令时Z轴与Y轴只能用半径编程，X轴则由参数进行选择;
G17和G19平面下的C刀补的刀尖方向为0。`
  },
  {
    title: 'G28(回机床零点)',
    content: `G28 机床回零点
格式 G28 X0 Z0
回到机床零点`
  },
  {
    title: 'G32(车螺纹)',
    content: `G32 车螺纹
格式 G32 X(U)_ F_
格式 G32 Z(W)_ F_
以F速度移动到X(U)或者Z(W)位置然后停止(不能像G92一样自动退刀，需要自己编写)
例:
G0 Z2
X30
G32 Z-30 F3
G0 X31
Z2
X29.5
G32 Z-30 F3
G0 X31
Z2
...`
  },
  {
    title: 'G32.1(刚性螺纹切削代码)',
    content: `代码格式: G32.1 X(U)_ Z(W)_ C(H)_ F(I)_ S_;
代码功能: 传统的螺纹插补是利用装在主轴上的位置编码器反馈的脉冲数，计算出进给轴的当前移动量，以实现进给轴跟随主轴的螺纹插补方式，其缺点是在加/减速处的螺纹导程误差较大。在刚性螺纹插补方式中，主轴电机的工作和伺服电机一样，由进给轴和主轴之间的插补来执行螺纹插补，从而得到精度较高的螺纹。
代码说明: G32.1: 刚性螺纹插补的G代码;
C: 螺纹插补的起始角度;
(X,Z): 螺纹插补的终点坐标;
F(I): 螺纹的导程，F(I)>0右旋螺纹，F(I)<0左旋螺纹;
S: 主轴的转速;
注意事项: 主轴必须工作在位置控制方式;在有多主轴控制功能的情况下，则G32.1只允许在第1主轴同进给轴之间使用，使用的方法及相关的参数设定同刚性攻丝;在执行G32.1指令时，CNC系统不会检测当前的主轴是处于位置控制方式还是速度控制方式，因此在使用本指令时，请将第1主轴的伺服控制轴设定为Cs轴工作方式，以保证安全;C轴的绝对坐标要设定为循环方式，避免坐标值溢出;在主轴控制方式速度控制方式切换到位置方式，请执行主轴返回参考点操作或用G50指令设定当前C轴的起始位置;`
  },
  {
    title: 'G33 (Z轴攻丝循环)',
    content: `代码格式: G33 Z(W)_ F(I)_ L_;
代码功能: 刀具的运动轨迹是从起点到终点，再从终点回到起点。运动过程中主轴每转一圈Z轴移动一个螺距，与丝锥的螺距始终保持一致，在工件内孔形成一条螺旋切槽，可一次切削完成内孔的螺纹加工。
代码说明: G33为模态G代码;
Z(W): 不输入Z或W时，起点和终点的Z坐标值相同，不进行螺纹切削;
F: 螺纹导程;
I: 每英寸螺纹的牙数;
L: 多头螺纹的头数，取值范围1~99，省略L时默认为1头。
循环过程:
①Z轴进刀攻牙(G33代码前必须指定主轴开);
②到达编程指定的Z轴坐标终点后，M05信号输出;
③检测主轴完全停止后;
④顺时针转信号输出(与原来主轴旋转的方向相反);
⑤Z轴退刀到起点;
⑥M05信号输出，主轴停转;
⑦如为多头螺纹，重复①~⑥步骤。`
  },
  {
    title: 'G34(变螺距螺纹切削代码)',
    content: `代码格式: G34 X(U)_ Z(W)_ F(I)_ J_ K_ R_;
代码功能: 刀具的运动轨迹是从X、Z轴起点位置到程序段指定的终点位置的一条直线。从起点到终点位移量(X轴按半径值)较大的坐标轴称为长轴，另一个坐标轴称为短轴，运动过程中主轴每转一圈长轴移动一个导程，并且主轴每转一圈移动的螺距是不断增加指定的值或减少指定的值，在工件表面形成一条变螺距的螺旋切槽，实现变螺距螺纹的加工。切削时，可以设定退刀量。F、I代码字分别用于指定螺纹的螺距，执行G34代码可以加工公制或英制变螺距的直螺纹、锥螺纹和端面螺纹。
代码说明: G34为模态G代码;
X(U)、Z(W)、J、K的意义与G32一致;
F: 指定导程;
I: 指定每英寸螺纹的牙数;
R: 主轴每转螺距的增量值或减量值，R=F1-F2，R带有方向;
  F1>F2时，R为负值时螺距递减;
  F1<F2时，R为正值时螺距递增;
R值的范围: ±0.001~±500.000毫米/每螺距(公制螺纹); ±0.060~±25400牙/每英寸(英制螺纹)。
当R值超过上述范围值和因R的增加/减小使螺距超过允许值或螺距出现负值时产生报警。`
  },
  {
    title: 'G40(取消刀尖半径补偿)',
    content: `G40 取消刀尖补偿
格式 G40
取消刀尖补偿 用过刀尖补偿以后(G42 G41)必须加个G40取消刀尖补偿`
  },
  {
    title: 'G41(右侧刀尖半径补偿)',
    content: `G41一般用于车孔(前置刀架)
格式 G41 (刀补里面要修改T和R)
一般车锥度、圆弧才能用到，可以保证精度。`
  },
  {
    title: 'G42(左侧刀尖半径补偿)',
    content: `G42一般用于车外圆(前置刀架)
格式 G42 (刀补里面要修改T和R)
一般车锥度、圆弧才能用到，可以保证精度。`
  },
  {
    title: 'G50(修改工件坐标系)G50 Sxxx',
    content: `G50 修改工件坐标或最高转速
1.常用于一次装夹车多个工件
例: G50 Z0(把当前Z位置设置成0)
例: G50 W-10(当前Z轴0点向正的方向移动10)
2.恒限速设置最高限速
例: G50 S1300(恒限速设置最高限速为1300)`
  },
  {
    title: 'G70(精加工循环)',
    content: `G70 精加工循环
常用于G71 G72 G73后面精加工循环
格式: G70 P(ns) Q(nf)
P(ns):精加工形状程序的第一个段号。
Q(nf):精加工形状程序的最后一个段号`
  },
  {
    title: 'G71(内外径粗加工循环)',
    content: `G71外圆内孔粗加工循环
格式:
G71 U(△d) R(e)
G71 P(ns) Q(nf) U(△u) W(△w) F(f)
U(△d): 每刀切削深度(半径)
R(e): 每刀切削X方向以后退刀距离
P(ns): 精加工形状程序的第一个段号
Q(nf): 精加工形状程序的最后一个段号
U(△u): X方向精加工预留量的距离及方向(直径)
W(△w): Z方向精加工预留量的距离及方向。
F(f): 进刀速度
例:
G71 U1 R0.5
G71 P1 Q2 U0.2 W0.1 F0.2
N1......
N2...`
  },
  {
    title: 'G72(端面粗加工循环)',
    content: `G72 端面粗加工循环
格式:
G72 W(△d) R(e)
G72 P(ns) Q(nf) U(△u) W(△w) F(f)
W(△d): 每刀Z切削深度
R(e): 每刀切削Z方向以后退刀距离
P(ns): 精加工形状程序的第一个段号
Q(nf): 精加工形状程序的最后一个段号
U(△u): X方向精加工预留量的距离及方向(直径)
W(△w): Z方向精加工预留量的距离及方向。
F(f): 进刀速度
例:
G72 W1 R0.5
G72 P1 Q2 U0.2 W0.1 F0.2
N1......
N2...`
  },
  {
    title: 'G73(封闭型粗加工循环)',
    content: `G73 封闭粗加工循环
格式:
G73 U(△i) W(△d) R(e)
G73 P(ns) Q(nf) U(△u) W(△w) F(f)
U(△i): X轴方向退刀距离(半径指定)
W(△d): Z轴方向退刀距离(半径指定)
R(e): 粗车刀数
P(ns): 精加工形状程序的第一个段号
Q(nf): 精加工形状程序的最后一个段号
U(△u): X方向精加工预留量的距离及方向(直径)
W(△w): Z方向精加工预留量的距离及方向。
F(f): 进刀速度
例:
G73 U5 R5
G73 P1 Q2 U0.2 W0.1 F0.2
N1...
N2...`
  },
  {
    title: 'G74(Z项步进循环)',
    content: `G74 钻孔, 断面槽循环
常与用钻孔, 断面槽粗车和断销切削
格式:
G74 R(e)
G74 X(u) Z(w) P(△i) Q(△k) F(f)
e:退刀量
X(u): X项最终切削尺寸
Z(w): Z项最终切削尺寸
P(△i): X项每次移动量(半径) (mm或者μ)
Q(△k): Z项每次移动量 (mm或者μ)
F(f):进刀速度

钻孔例: 孔深20mm 每次钻2mm
G0 X0
Z2
G74 R0.5
G74 X0 Z-20 Q2000 F0.1

断面槽例: 小圆20 大圆35 深度5 刀宽3 X项每次移动2mm Z项每次进1mm (实际编程中自行加上刀宽)
G0 X20
Z2
G74 R0.5
G74 X35 Z-5 P2000 Q1000 F0.05`
  },
  {
    title: 'G75(X项步进循环)',
    content: `G75 外圆 内孔槽循环
常与用切槽粗车循环
格式:
G75 R(e)
G75 X(u) Z(w) P(△i) Q(△k) F(f)
e:退刀量
X(u): X项最终切削尺寸
Z(w): Z项最终切削尺寸
P(△i): X项每次移动量(半径) (mm或者μ)
Q(△k): Z项每次移动量 (mm或者μ)
F(f):进刀速度
例:
G0 X42
Z2
Z-5
G75 R0.5
G75 X35 Z-20 P500 Q2000 F0.05`
  },
  {
    title: 'G76(复合型螺纹切削)',
    content: `G76 复合型螺纹切削循环
侧边进刀，减小切削量，增加刀具寿命
格式:
G76 P020060 Q每次进刀量 R0.01
G76 X底径 Z-螺纹长度 P牙高 Q第一刀进刀量 F螺距

详解:
P020060: 分为3个参数:
  02代表最后一刀精车2次
  00代表退尾为0
  60代表螺纹角度为60度
Q每次进刀量(单边) (mm/μ)
R0.01最后一刀留0.01精车余量
X低径(螺纹底径或者大径)
Z-螺纹长度(螺纹长度)
P牙高(牙型高度)
Q第一刀进刀量(单边) (mm/μ)
F螺距`
  },
  {
    title: 'G83(深钻孔循环)',
    content: `G83 钻孔和G74一样，比G74好用，这个是钻进去以后在退到定位点，防止卡屑和烧钻头。但是有的车床不支持，不支持的话就用宏程序里面的宏钻孔，效果和G83一样的
代码格式:
G83 R(距离上次深度)
G83 Z(孔深度) Q(每次深度) F(进刀速度)
实际使用编程格式如下:
G0 X0 Z2
G83 R0.5
G83 Z-30 Q2000 F0.05
G0 Z11
这个就是孔深30 每次钻2毫米 每次退到Z2 然后快速移动到上次位置+0.5的地方
比如钻到Z-20以后 快速退到Z2 然后在快速到Z-19.5`
  },
  {
    title: 'G84、G88(刚性攻丝)',
    content: `代码格式:
端面刚性攻丝 G84 X(U)_ C(H)_ Z(W)_ P_ F(I)_ K_ M_;
侧面刚性攻丝 G88 Z(W)_ C(H)_ X(U)_ P_ F(I)_ K_ M_;
代码说明: 模态G代码
G84: 端面攻丝循环G代码
G88: 侧面攻丝循环G代码
(X, C): 攻丝孔位置; ------G84
Z: 攻丝孔底位置; ------G84
(Z, C): 攻丝孔位置; ------G88
X: 攻丝孔底位置; ------G88
P: 攻丝到孔底暂停的时间(ms)
F(I): 螺纹的导程，F(I)>0右旋攻丝，F(I)<0左旋攻丝
K: 攻丝重复次数，如果攻丝孔位置为相对坐标编程，则是在不同的孔位置攻丝
M: 用于夹紧分度主轴的M代码。
指定刚性攻丝的方法:
在G84/G88指令之前指定M29 S_，如下
M29 S_;
G84(G88) X_C_(Z_C_) Z_(X_) P_ F_ K_ M_;
在相同程序段中指令M29 S_，如下
G84(G88) X_C_(Z_C_) Z_(X_) R_ P_ F_ K_ M29 S_;`
  },
  {
    title: 'G87(侧面钻孔循环)',
    content: `这个普通车床不支持需要带动力头的
G87 Z(W)_ C(H)_ 或者X(U)/Y(V)_ R_ Q_ P_ F_ K_ M_
Z(W)_ C_ or X(U)/Y(M)_ C_: 孔底位置绝对值(从R点到洞底的增量值)
●欲使用Y(V)引数, Pr4019需设为0
R:初始点到R点的增量值(正负号无效，无论钻孔方向之轴向为直/半径轴，R引数带入半径量即可)
Q:每次进给深度(正负号无效)
P:洞底暂停时间(有小数点，以秒为单位;无小数点，参考Pr17与Pr3241)
F:进给速率
K:重复次数
M: C轴钳住(Clamp)的M Code, Clamp Code加1为C轴松开(Unclamp Code)
I: Pr4008(高速钻孔或攻牙模式)设定为1时有效，上拉段Overlapping距离
J: Pr4008(高速钻孔或攻牙模式)设定为1时有效，横移段Overlapping距离
PS:(这个不要问我 我也不懂)`
  },
  {
    title: 'G90(内外径加工循环)',
    content: `G90 直线切削循环
格式:
G90 X(U)_ Z(W)_ F_
例:
G0 X30 Z2
G90 X28 Z-10 F0.2 (完整此步骤工件直径为φ28 长度为10)
X26 (完整此步骤工件直径为φ26 长度为10)
X24 (完整此步骤工件直径为φ24 长度为10)
...

锥体切削循环:
G90 X(U)_ Z(W)_ R_ F_`
  },
  {
    title: 'G92(直切削螺纹循环)',
    content: `G92 螺纹切削循环
格式:
G92 X(U)_ Z(W)_ F_
例:
G0 X31 Z2
G92 X29.8 Z-10 F2
X29.6
X29.4
...

锥螺纹切削循环:
G92 X(U)_ Z(W)_ R_ F_
R_: (大径-小径)/2 (一般外圆为"一"内孔为正)
例:
G0 X31 Z2
G92 X29.8 Z-10 R-0.46 F2
X29.6
X29.4
...`
  },
  {
    title: 'G94(端面加工循环)',
    content: `G94 断面切削循环
格式:
G94 X(U)_ Z(W)_ F_
例:
G0 X40 Z2
G94 X25 Z-10 F0.2 (完整此步骤工件直径为φ25 长度为10)
Z-12 (完整此步骤工件直径为φ25 长度为12)
Z-14 (完整此步骤工件直径为φ25 长度为14)
...

锥体切削循环:
G94 X(U)_ Z(W)_ R_ F_`
  },
  {
    title: 'G96(开启恒限速)',
    content: `G96 恒限速设定
格式:
G96 S_
S_:恒限速 (3.14*直径*转速/1000)
例:
不用恒限速φ100的直径要车断面，你觉得300转比较合适
直径在100的时候转速是300
直径在50的时候转速还是300
直径在10的时候转速还是300

用恒限速
G50 S800 (一定要设置一个最高转速，防止工件甩飞)
G96 S94
...
G97 S500 (一定要取消恒限速，)`
  },
  {
    title: 'G97(取消恒限速)',
    content: `G97 恒限速取消
格式:
G97 S500 (设置当前转速为500)

用恒限速
G50 S800
G96 S94
...
G97 S500 (一定要取消恒限速，)`
  },
  {
    title: 'G98每分钟进给',
    content: `代码格式: G98 F_;
代码功能: 以mm/min为单位给定切削进给速度，G98为模态G代码，如果当前为G98模态，可以不输入G98。
G98、G99为同组的模态G代码，只能一个有效。G98为初态G代码，CNC上电时默认G98有效。
每转进给量与每分钟进给量的换算公式:
Fm = Fr×S
其中: Fm: 每分钟的进给量(mm/min);Fr: 每转进给量(mm/r);S: 主轴转速(r/min)。
CNC上电时，进给速度为CNC状态参数NO.030设定的值，执行F代码后，F值保持不变。执行F0后，进给速度为0。CNC复位、急停时，F值保持不变。`
  },
  {
    title: 'G99每转进给',
    content: `代码格式: G99 F_;
代码功能: 以毫米/转为单位给定切削进给速度，G99为模态G代码。如果当前为G99模态，可以不输入G99。
CNC执行G99 F_时，把F代码值(毫米/转)与当前主轴转速(r/min)的乘积作为代码进给速度控制实际的切削进给速度，主轴转速变化时，实际的切削进给速度随着改变。
使用G99F_给定主轴每转的切削进给量，可以在工件表面形成均匀的切削纹路。
在G99模态进行加工，机床必须安装主轴编码器。
G98、G99为同组的模态G代码，只能一个有效。G98为初态G代码，CNC上电时默认G98有效。
每转进给量与每分钟进给量的换算公式:
Fm = Fr×S
其中: Fm: 每分钟的进给量(mm/min);Fr: 每转进给量(mm/r);S: 主轴转速(r/min)。
CNC上电时，进给速度为CNC状态参数NO.030设定的值，执行F代码后，F值保持不变。执行F0后，进给速度为0。CNC复位、急停时，F值保持不变。`
  },
];
